[
    {
        "text": "i'm looking to SELL my app text-behind-image > 300K users, avg. 5K site visits daily > asking price: $50K i'm a 17 y/o high school student - never could have thought i'd write & make public something of this nature at this point in my life lol more details below. DMs open",
        "likes": 42,
        "retweets": 23,
        "views": 107000,
        "url": "",
        "engagement_score": 88
    },
    {
        "text": "\"Bro this can be built in 30 mins. Come on\" \"Doesn’t this take like 2 minutes in photoshop? Lol\" \"if someone wants to build this i can show exactly step by step how it is done. which apis to use from replicate or\" Just some of the comments on @rexan_wong post. Honestly,",
        "likes": 42,
        "retweets": 23,
        "views": 107000,
        "url": "",
        "engagement_score": 87
    },
    {
        "text": "I think the best would be \"take your parents to work day\" as I find it so hard to explain to my parents what being a startup founder is",
        "likes": 11,
        "retweets": 34,
        "views": 136000,
        "url": "",
        "engagement_score": 45
    },
    {
        "text": "When people ask me: Why are you building in Lisbon? My answer in a single pic:",
        "likes": 33,
        "retweets": 3,
        "views": 18000,
        "url": "",
        "engagement_score": 39
    },
    {
        "text": "For years, I've been hearing the same thing, over and over again: \"You gotta be in SF for the real action.\" But I feel times are changing. The truth? Brilliant builders are EVERYWHERE. As builders, we're not just chasing VC money anymore, we're bootstrapping, innovating, and creating sh*t from our laptops across the globe. So why can't we nurture that same vibrant community right here in Europe? Since arriving in Lisbon 1.5 years ago, it has been on my mind since D1 to build a community of Builders right here in Lisbon. And bit by bit? We're getting there. @iamgdsa and I joined forces with @_baretto to help host @IndieBeers right here in Lisbon. The result? 100 super interesting people connecting every single month.  But we're just getting started... Introducing: Indie Dinners  Our mission? Simple yet powerful. A monthly feast with 8 brilliant minds who are true BUILDERS. http://indiedinner.com This is just the beginning. Stay tuned for what's next...  until then, sign up",
        "likes": 23,
        "retweets": 4,
        "views": 664,
        "url": "",
        "engagement_score": 31
    },
    {
        "text": "We found PMF through a \"12 apps in 12 weeks\" challenge. Here's why it's the BEST framework for bootstrapping",
        "likes": 17,
        "retweets": 3,
        "views": 51200,
        "url": "",
        "engagement_score": 23
    },
    {
        "text": "One year ago: 0 paying users  Spent 6 months building an MVP  Avoided AI tools like Github Copilot  Obsessed over perfect code and design Today: 200+ recurring paying users in 4 months  Embraced AI heavily (Cursor, Claude) to ship faster  Building MVPs in 2/3 days,",
        "likes": 13,
        "retweets": 4,
        "views": 14000,
        "url": "",
        "engagement_score": 21
    },
    {
        "text": "One year ago: 0 paying users Spent 6 months building an MVP Avoided AI tools like Github Copilot Obsessed over perfect code and design Today: 200+ recurring paying users in 4 months Embraced AI heavily (Cursor, Claude) to ship faster Building MVPs in 2/3 days,",
        "likes": 13,
        "retweets": 4,
        "views": 14000,
        "url": "",
        "engagement_score": 21
    },
    {
        "text": "Building Daily  http://shortimize.com - short form content tracking http://findmecreators.com - scaling creators networks http://influencersdb.com - lifetime influencer database",
        "likes": 0,
        "retweets": 0,
        "views": 0,
        "url": "",
        "engagement_score": 1
    },
    {
        "text": "Going on LinkedIn and seeing: Looking for 300 users to alpha test my new app. OR Launching my personal finance app in 55 days They’re so NGMI. Just SHIP IT!!",
        "likes": 0,
        "retweets": 0,
        "views": 0,
        "url": "",
        "engagement_score": 0
    }
]